In [1]:
# -*- coding: utf-8 -*-
"""
Created on Tue Sep  3 19:12:02 2019

@author: sscodes(SANKET SARKAR)
"""

'\nCreated on Tue Sep  3 19:12:02 2019\n\n@author: sscodes(SANKET SARKAR)\n'

In [2]:
# Missing Data

In [3]:
import numpy as np

In [1]:
import pandas as pd

In [6]:
d={'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan],'C':[1, 2, 3]}

In [7]:
df=pd.DataFrame(d)

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [10]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [13]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [15]:
# groupby

In [16]:
"""
groupby allows you to group together rows based off of a column and perform an aggregate function on them.

"""

'\ngroupby allows you to group together rows based off of a column and perform an aggregate function on them.\n\n'

In [20]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales':[200, 120, 340, 124, 243, 350]}

In [21]:
df=pd.DataFrame(data)

In [22]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
byComp=df.groupby('Company')

In [24]:
byComp

In [25]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [26]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [27]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [29]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [30]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [31]:
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [32]:
byComp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [33]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [34]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [35]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [3]:
a=pd.read_csv("example")

In [4]:
a

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15